PKS1C/src/Reports/ТабличныйМесячныйОтчет/ТабличныйМесячныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ТабличныйМесячныйОтчет</name>
</mdclass:Report>

PKS1C/src/InformationRegisters/ПочасовыеРаботы/ПочасовыеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочасовыеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Удаленка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сверхурочка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставРабот</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкиКлиентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Reports/ТабличныйМесячныйОтчет/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере(Месяц)
	Месяц = КонецДня(Месяц);
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Отчеты.ТабличныйМесячныйОтчет.ПолучитьМакет("Макет");
	
	ОбластьПараметры = Макет.ПолучитьОбласть("Параметры");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьПараметры.Параметры.Месяц = Формат(Месяц, "ДФ=ММ.гггг");
	ТабДок.Вывести(ОбластьПараметры);
	ТабДок.Вывести(ОбластьШапка);
	
	ЗапросРабот = Новый Запрос;
	ЗапросРабот.Текст = 
		"ВЫБРАТЬ
		|	ПочасовыеРаботы.Регистратор.Дата КАК Дата,
		|	ПочасовыеРаботы.Исполнитель КАК Исполнитель,
		|	ПочасовыеРаботы.Регистратор.Ссылка КАК РегистраторСсылка
		|ИЗ
		|	РегистрСведений.ПочасовыеРаботы КАК ПочасовыеРаботы
		|ГДЕ
		|	ПочасовыеРаботы.Регистратор.Дата МЕЖДУ &От И &До
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	ЗапросРабот.УстановитьПараметр("До", КонецМесяца(Месяц)) ;
	ЗапросРабот.УстановитьПараметр("От", Месяц);
	
	РезультатЗапросаРабот = ЗапросРабот.Выполнить();
	
	ВыборкаРабот = РезультатЗапросаРабот.Выбрать();
	ВыборкаРабот.Следующий();
	
	Дата = Месяц;
	
	Если ВыборкаРабот.Количество() = 0 Тогда
		Сообщить("В данном месяце работ не было");
		Возврат;
	КонецЕсли; 
		
	Пока Дата <= КонецМесяца(Месяц) Цикл
		Строка = 1;

		ОбластьСтрока.Параметры.Валера = "";
		ОбластьСтрока.Параметры.Костя = "";
		ОбластьСтрока.Параметры.Сережа = "";
		ОбластьСтрока.Параметры.Паша = "";
		ОбластьСтрока.Параметры.Юля = "";
		ОбластьСтрока.Параметры.Никита = "";
		
		ОбластьСтрока.Параметры.Дата = Формат(Дата, "ДФ=дд.ММ.гггг");	
		
		Пока Дата = КонецДня(ВыборкаРабот.Дата) Цикл
			Если ВыборкаРабот.Исполнитель = Справочники.ФизическиеЛица.НайтиПоНаименованию("Иевский Валерий Игоревич") Тогда
				ОбластьСтрока.Параметры.Валера = "█";
				ОбластьСтрока.Параметры.РаботаВалера = ВыборкаРабот.РегистраторСсылка;
			КонецЕсли;
			
			Если ВыборкаРабот.Исполнитель = Справочники.ФизическиеЛица.НайтиПоНаименованию("Карпов Константин Сергеевич") Тогда
				ОбластьСтрока.Параметры.Костя = "█";
				ОбластьСтрока.Параметры.РаботаКостя = ВыборкаРабот.РегистраторСсылка;
			КонецЕсли;
			
			Если ВыборкаРабот.Исполнитель = Справочники.ФизическиеЛица.НайтиПоНаименованию("Каргин Сергей Михайлович") Тогда
				ОбластьСтрока.Параметры.Сережа = "█";
				ОбластьСтрока.Параметры.РаботаСережа = ВыборкаРабот.РегистраторСсылка;
			КонецЕсли;
			
			Если ВыборкаРабот.Исполнитель = Справочники.ФизическиеЛица.НайтиПоНаименованию("Бондаренко Павел Александрович") Тогда
				ОбластьСтрока.Параметры.Паша = "█";
				ОбластьСтрока.Параметры.РаботаПаша = ВыборкаРабот.РегистраторСсылка;
			КонецЕсли;
			
			Если ВыборкаРабот.Исполнитель = Справочники.ФизическиеЛица.НайтиПоНаименованию("Бондаренко Юлия Николаевна") Тогда
				ОбластьСтрока.Параметры.Юля = "█";
				ОбластьСтрока.Параметры.РаботаЮля = ВыборкаРабот.РегистраторСсылка;
			КонецЕсли;
			
			Если ВыборкаРабот.Исполнитель = Справочники.ФизическиеЛица.НайтиПоНаименованию("Чулков Никита Алексеевич") Тогда
				ОбластьСтрока.Параметры.Никита = "█";
				ОбластьСтрока.Параметры.РаботаНикита = ВыборкаРабот.РегистраторСсылка;
			КонецЕсли;
			
			ВыборкаРабот.Следующий();
			Строка = Строка + 1;
			
			Если Строка = ВыборкаРабот.Количество() Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла; 
				
		ТабДок.Вывести(ОбластьСтрока);		
		
		Если ДеньНедели(Дата) >= 6 Тогда
			Ячейка = ТабДок.Область("R" + Строка(День(Дата) + 3) + "C2");
			Ячейка.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;

		Дата = Дата + 86400;
	КонецЦикла;   	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(Месяц);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Месяц = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2");
КонецПроцедуры
